#include <iostream>
#include <cmath>

using namespace std;

int main() {

    short n;        // Параметр зовнішнього циклу
    double x, y;    // Абсциса та ордината графіка
    short h;        // Позиція точки на екрані

    // Зовнішній цикл для 5 періодів
    for (n = 0; n < 5; n++) {
        // Виведення заголовка таблиці
        printf("|   x   |      y     |\n");
        printf("|-------|------------|\n");

        // Внутрішній цикл для одного періоду
        for (x = 0; x <= 5; x += 0.25) {
            // 1-й відрізок: нижня напівокружність
            if (x < 2) 
                y = -sqrt(1 - pow(x - 1, 2));
            // 2-й відрізок: верхня напівокружність
            else if (x < 4) 
                y = sqrt(1 - pow(x - 3, 2));
            // 3-й відрізок: горизонтальна лінія
            else  
                y = -1;

            // Вивід рядка таблиці
            printf("| %5.2lf | %10.7lf |", x + n * 5, y);

            // Визначення позиції точки на графіку
            h = (y + 1) * 10; // Позиція точки по висоті
            if ((y + 1) * 10 - h > 0.5) h++; // Округлення

            // Вивід точки графіка
            for (; h > 0; h--) printf(" ");
            printf("*\n");
        }

        // Пауза для продовження
        printf("Натисніть клавішу Enter...");
        getchar();
    }

    return 0;
}
